<?php





// $arr=['a', 'b', 'c'];

// echo "<pre>";
// var_dump($arr);
// echo "</pre>";



// $arr=['a', 'b', 'c'];

// for ($i=0; $i < 3; $i++) { 
//   echo $arr[$i];
// }



// $arr = ['a', 'b', 'c', 'd'];

//   echo $arr[0]. '+'. $arr[1]. ','. $arr[2]. '+'. $arr[3];

//




// for ($i=0; $i < 6; $i++) { 
// 	$arr[$i]=$i;
// }



// echo "<pre>";
// var_dump($arr);
// echo "</pre>";






// $arr = ['a'=>1, 'b'=>2, 'c'=>3];

// echo $arr['c'];




// $arr = ['a'=>1, 'b'=>2, 'c'=>3];

// foreach ($arr as $i) {
// 	$sum = $sum+$i;
// }

// echo $sum;




// $arr = ['Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'];

// echo 'Зарплата Пети - '.$arr['Петя'].'<Br>';
// echo 'Зарплата Коли - '.$arr['Коля'];



// $arr = ['1'=>'Понедельник', '2'=>'Вторник', '3'=>'Среда', '4'=>'Четверг', '5'=>'Пятница', '6'=>'Суббота', '7'=>'Воскресенье'];
// echo $arr['1'];



// $arr = ['1'=>'Понедельник', '2'=>'Вторник', '3'=>'Среда', '4'=>'Четверг', '5'=>'Пятница', '6'=>'Суббота', '7'=>'Воскресенье'];

// $day=3;
//  echo $arr[$day];




// $arr = [
// 	'cms'=>['joomla', 'wordpress', 'drupal'],
// 	'colors'=>['blue'=>'голубой', 'red'=>'красный', 'green'=>'зеленый']
// ];

// echo $arr['cms']['0'].'<br>';
// echo $arr['cms']['2'].'<br>';
// echo $arr['colors']['green'].'<br>';
// echo $arr['colors']['red'].'<br>';














 ?>